---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
GeometryCreationUtilities..::..CreateBlendGeometry Method
GeometryCreationUtilities Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<(Of <<'(VertexPair>)>>)) | Creates a solid by blending two closed curve loops lying in non-coincident planes. |
|  | CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<(Of <<'(VertexPair>)>>), SolidOptions) | Creates a solid by blending two closed curve loops lying in non-coincident planes. |

# See Also

GeometryCreationUtilities Class

GeometryCreationUtilities Members

Autodesk.Revit.DB Namespace